{
    "main_menu": "📍 Негізгі мәзір:",
    "btn_glucose": "📈 Глюкометрия",
    "btn_bread": "🍞 Нан бірліктері",
    "btn_school": "📚 Диабет мектебі",
    "btn_settings": "⚙️ Баптаулар",

    "choose_action": "Әрекетті таңдаңыз:",
    "choose_measure": "Өлшеу түрін таңдаңыз:",
    "enter_value": "Қандағы қант деңгейін енгізіңіз (мысалы: 5.6)",
    "recorded": "Жазылды: {value} ммоль/л ({type})",
    "skipped": "Өлшеу өткізіліп алынды.",

    "type_fasting": "🕗 Ашқарын",
    "type_after": "🍽 Тамақтан кейін",
    "type_time": "⏱ Уақыт бойынша",
    "type_skip": "❌ Ұмыттым",

    "add_measure": "➕ Өлшеу қосу",
    "history": "📋 Тарих",
    "stats": "📊 Статистика",
    "back": "⬅️ Артқа",
    "to_menu": "🏠 Мәзірге",

    "glucose_min": "Мин.: {value} ммоль/л",
    "glucose_max": "Макс.: {value} ммоль/л",
    "glucose_count": "Жазбалар саны: {value}",

    "last_measures": "Соңғы өлшеулер:",
    "graph_title": "График:",

    "result_high": "Қорытынды: 🔴 Өте жоғары (гипергликемия)",
    "result_low": "Қорытынды: 🔵 Төмен (гипогликемия)",
    "result_normal": "🟢 Көрсеткіш қалыпты.",

    "language_choose": "Тілді таңдаңыз:",
    "language_changed": "Тіл сәтті өзгертілді 🇰🇿",
    "lang_kk": "🇰🇿 Қазақ тілі",
    "lang_changed_kk": "Тіл сәтті өзгертілді 🇰🇿",

    "ds.lessons": {
        "1": {
            "1.1": "Сабақ 1.1. Қант диабеті дегеніміз не?\n\nҚант диабеті (ҚД) — ұйқы безі жеткілікті инсулин бөлмегенде немесе ағза жасушалары инсулинге дұрыс жауап бермегенде пайда болатын созылмалы ауру.\n\nИнсулин — ұйқы безінің β-жасушаларында түзілетін гормон. Ол глюкозаның жасушаларға енуіне мүмкіндік береді. Инсулин жетіспесе немесе жасушалар оған төзімді болса, глюкоза жасушаларға өтпей, қанда жиналады. Бұл гипергликемия — қандағы қанттың тұрақты жоғарылауы.\n\nҚант диабетінің түрлері:\n1. 1-типті қант диабеті (ҚД1) — инсулин мүлдем шығарылмайды немесе өте аз мөлшерде өндіріледі. Күнделікті инсулин терапиясы қажет.\n2. 2-типті қант диабеті (ҚД2) — ең кең таралған түрі (≈ 90%). Инсулин өндіріледі, бірақ жасушалар оған нашар жауап береді. Көбіне артық салмақ және аз қимылдан дамиды. Емі: дұрыс тамақтану, белсенді өмір салты және қажет болса қантты төмендететін препараттар.\n3. Гестациялық диабет — жүктілік кезінде пайда болады. Бала туғаннан кейін жоғалуы мүмкін, бірақ болашақта 2-типті диабет қаупін арттырады.\n\nМаңызды:\n1 және 2 типті қант диабеті созылмалы аурулар. Толық айығу мүмкін болмаса да, қазіргі ем тәсілдері:\n• қандағы қантты қалыпты деңгейде ұстауға;\n• асқынулардың алдын алуға;\n• өмір сапасын жақсартуға мүмкіндік береді.",
            "1.2": "Сабақ 1.2. Қандағы глюкозаның негізгі көздері\n\nГлюкоза — ағзаның негізгі энергия көзі. Ол барлық мүшелер мен жүйелердің қалыпты жұмыс істеуіне қажет. Қандағы глюкозаның тұрақты деңгейін сақтау денсаулық үшін маңызды, әсіресе қант диабеті бар адамдарға.\n\nГлюкозаның қанға түсуінің негізгі жолдары:\n\n1. Тағамдық көмірсулар\nГлюкозаның басты көзі — тағамдағы көмірсулар: нан, макарон, картоп, жармалар, жемістер, көкөністер, сүт өнімдері және тәттілер. Ас қорыту кезінде көмірсулар қарапайым қанттарға, соның ішінде глюкозаға дейін ыдырайды. Глюкоза ішектен қанға өтіп, қант деңгейін арттырады. Қарапайым көмірсулар тез сіңеді, күрделі көмірсулар баяу әрі бірқалыпты әсер береді.\n\n2. Бауырдағы гликоген\nТағамнан бөлек, ағза глюкозаны бауырда жиналған гликогеннен ала алады. Қандағы глюкоза төмендеген кезде бауыр гликогенолиз процесі арқылы гликогенді глюкозаға ыдыратады. Бұл аштықта, ұйқы кезінде және физикалық белсенділікте қант деңгейін тұрақты ұстауға көмектеседі.\n\n3. Глюконеогенез\nГликоген қоры таусылғанда (ұзақ аштық, төмен көмірсулы диета), ағза глюкозаны басқа заттардан синтездей бастайды. Бұл процесс глюконеогенез деп аталады және бауыр мен бүйректе жүреді. Онда аминқышқылдар, глицерин және лактат қолданылады. Глюконеогенез қандағы глюкоза деңгейін көмірсулар жетіспеген жағдайда да сақтауға мүмкіндік береді.",
            "1.3": "Сабақ 1.3. Қандағы глюкоза деңгейі: нормада және қант диабетінде\n\nГлюкоза — ағза жұмысының маңызды көрсеткіштерінің бірі. Оның деңгейін сау адамдар да, қант диабеті бар науқастар да бақылауы қажет.\n\nҚалыпты глюкоза деңгейі:\n• Ашқарында — 6,1 ммоль/л-ден аспайды.\n• Тағамнан 2 сағат кейін — 7,8 ммоль/л-ден жоғары емес.\n\nБұл тепе-теңдік ұйқы безі, бауыр және инсулин гормонының үйлесімді жұмысының арқасында сақталады. Инсулин глюкозаның жасушаға енуіне көмектесіп, энергия алмасуын қамтамасыз етеді.\n\nҚант диабетінде:\nРеттелу бұзылады — инсулин жетіспегенде глюкоза жасушаға енбей, қанда жиналады. Диагноз қойылады, егер:\n• ашқарындағы глюкоза ≥ 7,0 ммоль/л;\n• 75 г глюкоза қабылдағаннан кейін 2 сағаттан соң ≥ 11,1 ммоль/л.\n\nАралық жағдай — преддиабет:\n1. Глюкозаға төзімділіктің бұзылуы: 2 сағаттан кейін — 7,8–11,0 ммоль/л.\n2. Ашқарындағы гликемияның бұзылуы: ашқарында — 6,1–7,0 ммоль/л, 2 сағаттан кейін — 7,8 ммоль/л-ден аспайды.\n\nПреддиабет — 2-типті қант диабетінің даму қаупін көрсететін белгі. Тамақтануды түзету, салмақты бақылау және физикалық белсенділік бұл тәуекелді төмендетуге көмектеседі.",
            "1.4": "Сабақ 1.4. Қандағы глюкоза деңгейінің жоғарылауының белгілері (гипергликемия)\n\nГипергликемия — қандағы глюкоза деңгейі қалыптан жоғары болған жағдай. Бұл көбіне қант диабеті бар адамдарда инсулин жетіспегенде, дұрыс тамақтанбағанда, стресс немесе ауру кезінде пайда болады.\n\nГипергликемияның негізгі белгілері:\n\n1. Жиі және көп мөлшерде зәр шығару, ауыздың құрғауы, шөлдеу, терінің құрғауы, шаршау, салмақ жоғалту.\n• Қандағы қант деңгейі 8–10 ммоль/л-ден асқанда, бүйрек артық глюкозаны зәрмен шығара бастайды.\n• Бұл ағзаның суды көп жоғалтуына әкеліп, сусыздануға себеп болады.\n\nМаңызды: гипергликемия кезінде сусызданудың алдын алу үшін жеткілікті сұйықтық ішу қажет.\n\n2. Әлсіздік, тез шаршау, ұйқышылдық, тәбеттің жоғарылауы.\n• Қанда глюкоза көп болғанымен, жасушалар оны пайдалана алмайды — ағзада энергия тапшылығы байқалады.\n\n3. Салмақтың төмендеуі.\n• Глюкоза энергия көзі ретінде қолданылмаса, ағза май қорларын ыдыратып, энергия алады.\n\n4. Жаралардың баяу жазылуы және қабынулар.\n• Жоғары глюкоза деңгейі иммунитеттің төмендеуіне себеп болады.\n\n5. Терінің және шырышты қабықтардың қышуы.\n• Бұл глюкозаның жүйке ұштарына әсер етуімен байланысты.",
            "1.5": "Сабақ 1.5. Инсулиннің әсер ету механизмі\n\nИнсулин — ақуыз тектес гормон, ол ұйқы безінің β-жасушаларында түзіліп, тікелей қанға өтеді.\n\nИнсулинді «кілт», ал жасушаны «құлып» деп елестетуге болады. Инсулин осы «құлыпты» ашып, глюкозаның қаннан жасушаға енуіне мүмкіндік береді.\n\nЖасушаға түскен глюкоза энергия көзі ретінде пайдаланылады, ал қандағы қант деңгейі төмендейді — бұл инсулиннің қантты төмендету әсері.\n\nЕгер ағзада инсулин жеткіліксіз болса немесе жасушалар оған сезімталдығын жоғалтса, глюкоза жасушаға өте алмай, қанда жиналады. Бұл гипергликемияға әкеледі.\n\nСондықтан инсулин көмірсу алмасуын реттейтін негізгі гормон болып табылады және қандағы қант деңгейін қалыпты ұстауға көмектеседі."
        },

        "2": {
            "2.1": "Сабақ 2.1. Асқынулардың түрлері\n\nҚант диабетінің ең үлкен қауіптілігі — оның асқынулары. Қандағы глюкоза деңгейі ұзақ уақыт жоғары болса, көз, бүйрек, жүйке жүйесі және аяқтар сияқты мүшелер зақымданады.\n\nДиабет асқынулары екіге бөлінеді: созылмалы және жедел.\n\nСозылмалы асқынулар жылдар мен ондаған жылдар бойы жоғары глюкоза әсерінен дамиды. Гипергликемия ағзаның барлық жүйелеріне зиян келтіреді.\n– Диабеттік ретинопатия\n– Диабеттік нефропатия\n– Диабеттік полинейропатия\n\nЖедел асқынулар бірнеше сағат немесе күн ішінде дамиды. Олар қандағы глюкозаның күрт төмендеуімен немесе көтерілуімен байланысты.\nЖедел асқынуларға мыналар жатады:\n– Гипогликемия (жеңіл және ауыр)\n– Диабеттік кетоацидоз\n\nМаңызды: созылмалы асқынуларды қалыптастыру үшін жылдар қажет, ал жедел асқынулар бірнеше сағат ішінде пайда болуы мүмкін.",
            "2.2": "Сабақ 2.2. Кетоацидоз\n\nДиабеттік кетоацидоз (ДКА) — қант диабетінің жедел асқынуы. Ол қандағы глюкозаның жоғарылауымен және кетон денелерінің жиналуымен сипатталады.\n\nДКА кімде дамиды?\n• Көбіне 1-типті қант диабеті бар адамдарда.\n• Инсулинотерапия алатын 2-типті диабеті бар науқастарда да дамуы мүмкін.\n• Таблеткалық ем алатын 2-типті диабетте де ауыр қосалқы аурулар кезінде (операциялар, пневмония, инфекциялар) кездесуі мүмкін.\n\nАуыр аурулар кезінде ағзада инсулинге сезімталдықты төмендететін гормондар (кортизол, адреналин) көбірек бөлінеді. Бұл қандағы глюкоза деңгейін жоғарылатады, сондықтан кейде уақытша инсулин қажет.\n\nЗертханалық белгілері:\n• қандағы глюкозаның жоғары болуы,\n• май тіндерінің ыдырау өнімдері — кетон денелерінің артуы.\n\nНеге дамиды?\nИнсулин жетіспегенде ағза энергияны көмірсулардан ала алмайды. Сондықтан майларды ыдыратып, кетондар түзеді.\n\nКлиникалық белгілері:\n• гипергликемия белгілері (жүрек айну, құсу, іштің ауыруы, әлсіздік, естің бұзылуы)\n• жиі зәр шығару\n• қатты шөлдеу\n• салмақ жоғалту\n\nКетоацидоз кезінде не істеу керек?\nБұл жағдайдан өз бетімен шығу мүмкін емес.\n• дереу жедел жәрдем шақыру\n• стационарға жатқызу қажет\n\nЖедел жәрдем келгенге дейін:\nЕгер науқас есін білсе — минералды су беруге болады. Ондағы сілті кетондарды аздап төмендетуі мүмкін. Минералды су болмаса, жай су беріледі.",
            "2.3": "Сабақ 2.3. Диабеттік ретинопатия\n\nДиабеттік ретинопатия (ДР) — қандағы глюкозаның ұзақ уақыт жоғары болуына байланысты сетчатка тамырларының зақымдануы.\n\nДаму ерекшеліктері:\n• Бастапқы сатыларда тамырлардың ирелеңдеуі және микроаневризмалар пайда болады.\n• Кеш сатыларда қан құйылулар дамып, сетчатканың ажырауына және қайтымсыз көру жоғалуына әкелуі мүмкін.\n\nДиабеттік макулярлық ісіну (ДМО)\n• Тамыр өткізгіштігінің жоғарылауынан пайда болады.\n• ДР-дың кез келген сатысында, тіпті көз түбінде өзгеріс болмаса да кездесуі мүмкін.\n\nНеге ерте анықтау маңызды?\nБастапқы сатыларда көру нашарламайды — өзгерістерді тек офтальмолог анықтайды.\nЖылына кемінде 1 рет тексерілу — көз асқынуларының ең тиімді алдын алу.\nТексеру міндетті түрде қарашықты кеңейтіп (мидриаз) жүргізілуі керек.\n\nПрофилактика\nГликемияны жақсы бақылау ДР дамуын азайтады немесе баяулатады.\n\nЕмдеу тәсілдері:\n• лазерлік коагуляция,\n• ангиогенез ингибиторларын немесе ұзақ әсер ететін кортикостероидтарды интравитреалды енгізу,\n• витрэктомия.\n\nЕмдеу офтальмолог және эндокринолог консультациясынан кейін тағайындалады.",
            "2.4": "Сабақ 2.4. Диабеттік нефропатия\n\nДиабеттік нефропатия — ұзақ мерзімді гипергликемия нәтижесінде бүйрек тамырларының зақымдануы. Диабет жақсы бақылауда болса, өзгерістер дамымай қалуы мүмкін.\n\n1. Бүйрек қызметін диагностикалау\n• Зәрдің жалпы талдауы: тек ақуыздың жалпы мөлшерін көрсетеді, ерте кезеңде жеткіліксіз.\n• Микроальбуминурия (МАУ): альбуминнің пайда болуы — бастапқы зақым белгісі. Талдау жылына кемінде 1 рет.\n• Таңертеңгі зәрдегі альбумин/креатинин арақатынасы: норма — 30 мг/ммоль-ге дейін.\n• Тәуліктік зәр: ≤30 мг — норма; 30–300 мг — МАУ; >300 мг — протеинурия.\n• Ақуыздың басқа себептері: қабынулар (мысалы, созылмалы пиелонефрит).\n\n2. Диабеттік нефропатиядағы артериялық гипертензия\n• Қан қысымының жоғарылауы бүйректің жағдайын нашарлатады.\n• Қысымды себепке қарамастан бақылау қажет.\n• Қалыпты көрсеткіштер:\n  – 65 жасқа дейін: СҚҚ ≤130 мм сын. бағ.\n  – 65 жастан жоғары: СҚҚ ≤140 мм сын. бағ.\n  – ДҚҚ: ≤80 мм сын. бағ. (барлық жаста).\n• Көрсеткіштердің кез келгені жоғары болса — ем тағайындалады.\n\n3. Диабеттік нефропатия және СБА сатылары\nДиабеттік нефропатия — созылмалы бүйрек ауруының бір түрі. Сатысы зәрдегі альбумин деңгейіне және шумақтық фильтрация жылдамдығына байланысты анықталады. Терминалдық бүйрек жеткіліксіздігі — соңғы саты, тұрақты диализ қажет.",
            "2.5": "Сабақ 2.5. Диабеттік полинейропатия\n\nДиабеттік полинейропатия — ұзақ уақыттық гипергликемия нәтижесінде аяқ-қол жүйкелерінің зақымдануы. Ретинопатия мен нефропатияда ұсақ тамырлар әсер етсе, төменгі аяқ-қол нейропатиясында атеросклерозға байланысты ірі тамырлар зақымданады. Гипергликемия бұл процесті күшейтеді.\n\nНегізгі белгілері:\n• аяқтағы ауырсыну,\n• жану сезімі,\n• шаншу, «құмырсқа жорғалау»,\n• ұю — температура, ауырсыну және вибрация сезімінің төмендеуі.\n\nҚауіптері:\n• байқалмайтын жарақаттар (аяқ киімдегі бөгде зат, дұрыс емес аяқ киім),\n• табанның деформациясы салдарынан қысымның дұрыс бөлінбеуі,\n• сезімталдық төмен болғандықтан — ауырсынусыз дамитын қабыну және инфекциялар,\n• жаралар, флегмона, ауыр жағдайда — гангрена.\n\nАртериялардың зақымдалуы аяқтың қанмен қамтамасыз етілуін нашарлатады. Ерекше белгі — жүрген кезде балтырдың ауруы және тоқтап демалуға мәжбүр болу («үзік-үзік ақсау»).\n\nАлдын алу үшін «диабеттік аяқ» маманына жылына кемінде 1 рет қаралу немесе невропатологтың тексеруі қажет.\n\nНегізгі профилактика — глюкоза деңгейін қалыпқа келтіру. Қосымша шаралар — аяққа дұрыс күтім жасау және ортопедиялық аяқ киім кию.\n\nДиабет кезіндегі аяқ күтімі:\n\nНе істеу керек:\n1. Аяқтарды күнделікті тексеру.\n2. Жылы сумен жуу (35–37°C), жақсылап құрғату.\n3. Теріні ылғалдандыру, бірақ саусақ арасына крем жақпау.\n4. Тырнақты түзу қию.\n5. Жабық, жұмсақ, ыңғайлы, ортопедиялық аяқ киім кию.\n6. Табиғи матадан жасалған шұлықтар кию.\n7. Терлеу болса — тальк қолдану.\n\nНе істеуге болмайды:\n1. Жалаңаяқ жүру.\n2. Аяқты ыстық сумен, грелкамен немесе батареямен жылыту.\n3. Жараларды спирт, йод, жасыл дәрімен өңдеу — тек мирамистин/хлоргексидин.\n4. Мозоль, натоптыш, кірген тырнақты өздігінен алу.\n5. Тар, қатты, ашық аяқ киім кию.\n6. Электр простынка, грелка, 37°C-тан жоғары ванна қолдану."
        },

        "3": {
            "3.1": "Сабақ 3.1. Гликирленген гемоглобин (HbA1c)\n\nГликирленген гемоглобин (HbA1c) — қант диабетін бақылаудың негізгі көрсеткіші. Ол соңғы 2–3 айдағы қандағы глюкозаның орташа деңгейін көрсетеді.\n\nҚандағы глюкоза жоғарылаған сайын оның бір бөлігі эритроциттердегі гемоглобинге қосылады. Сондықтан HbA1c неғұрлым жоғары — қандағы қант соғұрлым ұзақ және жоғары болды деген сөз.\n\nHbA1c диабеттің жалпы компенсациясын бір реттік өлшеуге қарағанда дәлірек бағалайды.\n\nМақсатты HbA1c деңгейі:\n• көптеген ересектер үшін — 7,0 %-дан төмен;\n• нақты мақсат науқастың жасына, қосымша ауруларына және асқынулар деңгейіне байланысты.\n\nHbA1c жоғары болса:\n• қандағы қанттың жеткіліксіз бақыланғанын білдіреді;\n• қан тамырлары, жүйке, көз және бүйрек асқынуларының қаупін арттырады;\n• емдеу тактикасын және өмір салтын қайта қарауды қажет етеді.\n\nHbA1c көрсеткішін әр 3–6 ай сайын тексеру — ем тиімділігін бағалаудың міндетті бөлігі.",
            "3.2": "Сабақ 3.2. Қант диабетін емдеудегі жеке мақсаттар\n\nҚант диабетін емдеу әр науқасқа жеке жоспарланады. Себебі әр адамның жасы, ауру ұзақтығы, асқынулар деңгейі, денсаулық жағдайы және өмір салты әртүрлі.\n\nМақсат — науқасқа ең қолайлы ем жоспарын жасап, асқынулардың алдын алу және өмір сапасын жақсарту.\n\nНеге жеке тәсіл маңызды?\nҚант диабеті көз, бүйрек, аяқ-қол жүйкелерінің зақымдануына, сондай-ақ инфаркт пен инсульт қаупінің артуына әкелуі мүмкін. Сондықтан бірнеше маңызды көрсеткішті тұрақты бақылау қажет.\n\nНегізгі мақсатты көрсеткіштер:\n1) Гликирленген гемоглобин (HbA1c) — соңғы 2–3 айдағы қанттың орташа деңгейі. Көпшілік үшін мақсат — < 7,0 %.\n2) Қандағы глюкоза деңгейі — асқынулардың алдын алу және гипогликемия қаупін төмендету үшін қажет.\n3) Артериялық қысым — жоғары қысым жүрек, ми және бүйрек ауруларының қаупін арттырады.\n4) Липид алмасуы — төмен тығыздықтағы липопротеидтердің (ТТЛП) деңгейін бақылау керек. Мақсатты мән пациенттің жүрек-қантамырлық қауіп дәрежесіне байланысты анықталады.",
            "3.3": "Сабақ 3.3. Өзіндік бақылаудың техникалық құралдары\n\nГлюкометрлер\nГлюкометр — қандағы глюкоза деңгейін анықтайтын портативті құрал. Нәтижені 5–20 секундта көрсетеді және аз мөлшердегі қан тамшысын қажет етеді. Қазіргі құрылғыларда өлшеу тарихы мен орташа гликемияны есептеу функциялары бар.\n\nГлюкометр түрлері:\n1) Фотометриялық — тест-жолақ түсінің өзгеруін анықтайды.\n2) Электрохимиялық — глюкоза реакциясынан пайда болған электр тогын өлшейді.\n\nӨлшеу дәлдігі\nБарлық глюкометрлер ГОСТ Р ИСО 15197-2015 стандартына сай болуы тиіс:\n• глюкоза < 5.6 ммоль/л — ауытқу ≤ ±0.8 ммоль/л;\n• ≥ 5.6 ммоль/л — ауытқу ≤ ±15%.\nМысалдар: 4.0 → 3.2–4.8 ммоль/л; 10.0 → 8.0–12.0 ммоль/л.\n\nНәтижеге әсер ететін қателіктер:\n• қолдың таза болмауы;\n• крем не дезинфекциялаушы қалдықтар;\n• қанның жеткіліксіз түсуі;\n• мерзімі өткен тест-жолақтар;\n• температураның тым жоғары немесе төмен болуы.\n\nҚандағы глюкозаны үздіксіз бақылау жүйелері (НМГ)\nНМГ гипогликемия жиі болғанда немесе қантты жиі өлшеу қажет болғанда қолданылады. Сенсор тері астында орналасып, глюкозаны 5–15 минут сайын өлшейді. Қандағы және тіндердегі глюкоза айырмашылығына байланысты 8–10 минуттық кешігу болуы мүмкін.\n\nНМГ жүйелерінің түрлері:\n1) CGM — нақты уақыттағы бақылау: қант деңгейін, өзгеру бағытын көрсетеді, смартфонға дерек жібереді, ескерту дабылдары бар, калибрлеу қажет.\n2) FGM — флеш-мониторинг: деректер сенсорды смартфонға жақындатқанда көрінеді, калибрлеу қажет емес, инсулин, тағам және белсенділік деректерін енгізуге болады, электрондық күнделік жасайды.\n\nНМГ жүйелері қанттың мақсатты диапазонда болған уақытын, гипогликемия жиілігін және глюкоза ауытқуын талдауға мүмкіндік береді."
        },

        "4": {
            "4.1": "Сабақ 4.1. Инсулин препараттары\n\nИнсулин терапиясы — 1-типті қант диабетін емдеудің негізгі әдісі және 2-типті диабет кезінде де қолданылатын ем компоненті. Инсулин ағзада жеткіліксіз болғанда немесе мүлдем бөлінбегенде қандағы глюкоза деңгейін қалыпты ұстауға көмектеседі.\n\nШығу тегіне қарай инсулин түрлері\n1) Жануар тектес инсулиндер: бұрын шошқа және сиыр инсулині қолданылған, адам инсулинімен толық сәйкес келмегендіктен аллергия жиі туындаған.\n2) Адам инсулині: гендік инженерия арқылы алынған, адам инсулиніне толық ұқсас. Емдеудің қазіргі стандарты.\n3) Адам инсулинінің аналогтары: құрылымы өзгертілген, әсері жақсартылған — жылдам немесе ұзақ әсер етеді, қант деңгейін тұрақты ұстайды, қолдануға ыңғайлы.\n\nНеліктен әртүрлі инсулин түрлері қажет\nИнсулиннің әсер ету жылдамдығы мен ұзақтығы әртүрлі. Бұл дәрігерге науқасқа жеке емдеу схемасын таңдауға мүмкіндік береді және гипогликемия қаупін азайтады.\n\nИнсулин түрлері (әсерінің басталуы, шарықтауы және ұзақтығы)\n\n1) Өте жылдам әсер ететін (адам инсулинінің аналогтары)\n• Әсерінің басталуы: 1–10 минут\n• Шарықтау уақыты: 45–90 минут\n• Ұзақтығы: 3–5 сағат\n• Мысалдар: инсулин аспарт (+никотинамид + аргинин), инсулин лизпро 100 Б/мл (+трепростинил + натрий цитраты), инсулин лизпро 200 Б/мл (+трепростинил + натрий цитраты)\n\n2) Ультрақысқа әсер ететін (адам инсулинінің аналогтары)\n• Басталуы: 5–15 минут\n• Шарықтауы: 1–2 сағат\n• Ұзақтығы: 4–5 сағат\n• Мысалдар: инсулин лизпро 100/200 Б/мл, инсулин аспарт, инсулин глулизин\n\n3) Қысқа әсер ететін\n• Басталуы: 20–30 минут\n• Шарықтауы: 2–4 сағат\n• Ұзақтығы: 5–6 сағат\n• Мысалы: еритін адам инсулині\n\n4) Орташа әсер ету ұзақтығы бар\n• Басталуы: шамамен 2 сағат\n• Шарықтауы: 6–10 сағат\n• Ұзақтығы: 12–16 сағат\n• Мысалы: изофан адам инсулині (НПХ)\n\n5) Ұзақ әсер ететін (адам инсулинінің аналогтары)\n• Басталуы: 1–2 сағат\n• Шарықтау: айқын емес\n• Ұзақтығы: 24–36 сағат (кейде 29 сағатқа дейін)\n• Мысалдар: инсулин гларгин 100/300 Б/мл, инсулин детемир\n\n6) Өте ұзақ әсер ететін (адам инсулинінің аналогтары)\n• Басталуы: 30–90 минут\n• Шарықтау: айқын емес\n• Ұзақтығы: 42 сағаттан көп\n• Мысалы: инсулин деглудек",
            "4.2": "Сабақ 4.2. Инсулин терапиясының режимдері\n\nҚандағы қантты қалыпты деңгейге жақын ұстау үшін диабеті бар науқастарға инсулинді тәулігіне бірнеше рет енгізу қажет. Режим таңдауы науқастың жасына, өмір салтына және жеке қажеттіліктеріне байланысты.\n\n1. Интенсификацияланған инсулин терапиясы (көп мәрте инъекциялар)\nБұл режим инсулиннің табиғи бөлінуін имитациялайды.\n• Ұзақ әсер ететін инсулин — базалық деңгей үшін.\n• Қысқа немесе ультрақысқа инсулин — әр тағам алдында.\nАртықшылықтары: физиологиялық тиімділік, икемділік, дозаны реттеу мүмкіндігі.\nҚолданылуы: 1-типті диабет; қатаң бақылауды қажет ететін 2-типті диабет.\n\n2. Помпалық инсулин терапиясы\nИнсулин помпасы инсулинді тәулік бойы үздіксіз енгізеді.\n• Базальды доза — тұрақты.\n• Болюс — тағам алдында.\nАртықшылықтары: доза дәлдігі, гипо- және гипергликемия қаупінің азаюы, еркін өмір салты.\nҚолданылуы: 1-типті диабет, жеке режимді қажет ететін науқастар.\n\n3. Екі фазалы (аралас) инсулин терапиясы\nБір екпеде екі түрлі инсулин бар:\n• қысқа әсер ететін;\n• орташа әсер ету ұзақтығы бар.\nЕнгізілу тәртібі: күніне 2 рет — таңертең және кешке.\nАртықшылықтары: инъекция санының аз болуы, егде жастағы науқастарға қолайлы.\nЕрекшелігі: бірдей мөлшердегі көмірсулармен тұрақты тамақтану қажет.\n\nИнсулин терапиясының негізгі режимдері:\n1) Интенсификацияланған терапия — қысқа және ұзақ әсер ететін инсулинді тәуліктің әртүрлі уақытында енгізу. Қолданылуы: 1-типті және қатаң бақылау қажет 2-типті диабет.\n2) Инсулинді үздіксіз тері астына енгізу (помпалық терапия) — насос арқылы инсулинді бағдарламаланған режиммен беру. Қолданылуы: жеке режимді қажет ететін 1-типті диабет.\n3) Екі фазалы терапия — екі инсулиннің бір инъекцияда біріктірілуі. Қолданылуы: 2-типті диабет және егде жастағы науқастар.",
            "4.3": "Сабақ 4.3. Инсулин дозасын есептеу\n\nҚант диабеті бар адам үшін ең маңызды дағдылардың бірі — инсулин дозасын өз бетімен есептеп және реттей білу. Ағзаның қажеттілігі үнемі өзгеретіндіктен, инсулиннің тұрақты дозасы болмайды. Бұл әсіресе қысқа және ультрақысқа әсер ететін инсулинге қатысты. Оның мөлшері мыналарға байланысты:\n• қандағы глюкоза деңгейі;\n• тағамдағы көмірсулар мөлшері;\n• физикалық белсенділік;\n• жалпы жағдай және стресс деңгейі.\n\nНегізгі ереже:\n«50/50 ұзақ және қысқа инсулин» немесе «1 бірлік инсулин = 1 нан бірлігі» сияқты жалпы ұсыныстарға сүйенуге болмайды. Бұл — орташа мәліметтер. Дұрыс дозаның жалғыз көрсеткіші — қандағы қант деңгейінің тұрақтылығы.\n\nИнсулин дозасының дұрыстығын тексеру:\n1) Кешке енгізілетін ұзақ әсер ететін инсулин:\n• таңертең ашқарындағы қант қалыпты болса және түнгі гипогликемия болмаса — доза дұрыс;\n• тексеру кезінде ұйықтар алдындағы қант деңгейі қалыпты болуы қажет.\n\n2) Таңертең енгізілетін ұзақ әсер ететін инсулин:\n• түскі асты өткізіп, қысқа инсулин енгізбеңіз;\n• қант деңгейі кешке дейін тұрақты болса — доза дұрыс.\n\n3) Қысқа немесе ультрақысқа әсер ететін инсулин:\n• глюкозаны тамақтан кейін 2 сағаттан соң және келесі тағам алдында (4–6 сағаттан кейін) өлшеңіз;\n• түскі алдындағы қант таңертеңгі дозаның, кешкі алдындағы қант — түскі дозаның дұрыстығын көрсетеді.\n\nБұл тәсілдің маңызы:\nЖеке бақылау арқылы:\n• ем тиімділігі артады;\n• гипогликемия қаупі азаяды;\n• емдеу режимі тамақтану мен өмір салтына бейімделеді.",
            "4.4": "Сабақ 4.4. Көмірсу коэффициенті\n\nКөмірсу коэффициенті (КК) — белгілі бір мөлшердегі көмірсуды жабу үшін қажет инсулин саны. Ол 1 нан бірлігін (НБ) жабу үшін қанша инсулин қажет екенін немесе 1 инсулин бірлігі қанша грамм көмірсуды өтейтінін көрсетеді.\n\nЕсептеу формулалары:\nКК = болюстік доза / тәуліктегі НБ саны\nКК = тәуліктік инсулин дозасы / 50\n\nМысал:\nНауқас 2 НБ қабылдайды, КК = 2.0 болса:\n2 × 2.0 = 4 инсулин бірлігі.\nЯғни бұл тамақ мөлшерін жабу үшін 4 бірлік инсулин қажет.\n\nМаңызды:\n• КК таңертең, күндіз және кешке әртүрлі болуы мүмкін.\n• Жасқа, өмір салтына және физикалық белсенділікке байланысты өзгереді.\n• Индивидуалды түрде таңдалады және қандағы глюкозаға қарай түзетіледі.",
            "4.5": "Урок 4.5. Фактор чувствительности к инсулину\n\nФактор чувствительности к инсулину (ФЧИ) — это показатель, показывающий, на сколько ммоль/л 1 единица инсулина снижает уровень глюкозы крови. Этот показатель используется для расчёта дозы короткого инсулина, необходимой для снижения повышенного сахара.\n\nПример:\nЕсли глюкоза была 12 ммоль/л, и после введения 1 Ед инсулина через 4 часа стала 9 ммоль/л, то:\nФЧИ = 3,0 ммоль/л на 1 Ед инсулина."
        },

        "5": {
            "5.1": "Текст урока 5.1...",
            "5.2": "Текст урока 5.2..."
        }
    }
}
