{
    "main_menu_title": "Главное меню:",
    "menu_glucose": "📈 Глюкометрия",
    "menu_bread": "🍞 Хлебные единицы",
    "menu_school": "📚 Школа диабета",
    "menu_settings": "⚙️ Настройки",
    "back": "⬅ В меню",
    "glucose_add": "➕ Добавить измерение",
    "glucose_history": "📋 История",
    "glucose_stats": "📊 Статистика",
    "type_fasting": "🕗 Натощак",
    "type_after": "🍽 После еды",
    "type_time": "⏱ По времени",
    "type_skip": "❌ Забыл",
    "choose_measure": "Выберите тип измерения сахара:",
    "enter_value": "Введите уровень сахара (например: 5.6)",
    "recorded": "Записано: {value} ммоль/л ({type})",
    "skipped": "Измерение пропущено.",
    "history_title": "Последние измерения:",
    "stats_title": "Статистика:",
    "min": "Мин.:",
    "max": "Макс.:",
    "count": "Записей:",
    "choose_language": "Выберите язык / Тілді таңдаңыз:",
    "lang_ru": "🇷🇺 Русский",
    "lang_changed": "Язык успешно изменён 🇷🇺",



    "ds.lessons": {
        "1": {
            "1.1": "Урок 1.1. Что такое Сахарный Диабет\n\nСахарный диабет (СД) — это группа хронических заболеваний, при которых поджелудочная железа теряет способность вырабатывать достаточное количество инсулина и/или клетки организма перестают на него правильно реагировать.\n\nИнсулин — гормон, вырабатываемый β-клетками поджелудочной железы. Он действует как “ключ”, открывая клеткам доступ к глюкозе — главному источнику энергии.\n\nЕсли инсулина недостаточно или клетки становятся к нему нечувствительны (инсулинорезистентность), глюкоза не поступает в клетки и остаётся в крови, вызывая гипергликемию — стойкое повышение уровня сахара.\n\nГипергликемия приводит к ухудшению самочувствия и развитию поздних осложнений диабета.\n\nТипы сахарного диабета:\n1. Сахарный диабет 1 типа (СД1) — организм перестает вырабатывать инсулин; требуется пожизненная инсулинотерапия.\n2. Сахарный диабет 2 типа (СД2) — инсулин вырабатывается, но плохо действует; наиболее распространён.\n3. Гестационный диабет — развивается у беременных.\n\nВажно: диабет не излечивается полностью, но контролируется. Современные методы позволяют держать уровень глюкозы близким к норме и предотвращать осложнения.",
            "1.2": "Урок 1.2. Источники поступления глюкозы в кровь\n\nГлюкоза — основной источник энергии для клеток организма, необходимый для работы всех органов и систем. Поддержание стабильного уровня глюкозы важно для здоровья, особенно при сахарном диабете.\n\nНиже рассмотрены основные источники глюкозы в крови:\n\n1. Пищевые углеводы\nГлавный источник глюкозы — углеводы из пищи: хлеб, крупы, картофель, фрукты, овощи, молочные продукты, сладости. В кишечнике углеводы расщепляются до простых сахаров, включая глюкозу, которая затем поступает в кровь и повышает её уровень. Простые сахара повышают глюкозу быстро, сложные — медленнее и стабильнее.\n\n2. Гликоген печени\nПомимо пищи, организм получает глюкозу из гликогена, запасённого в печени. При снижении уровня сахара печень расщепляет гликоген (гликогенолиз) и выделяет глюкозу в кровь. Это помогает поддерживать уровень сахара между приёмами пищи и во время сна.\n\n3. Глюконеогенез\nКогда запасы гликогена исчерпываются (при голодании или низкоуглеводной диете), организм синтезирует глюкозу из других веществ: аминокислот, глицерина и лактата. Этот процесс, называемый глюконеогенезом, происходит в печени и почках и обеспечивает организм глюкозой при ограниченном поступлении углеводов.",
            "1.3": "Урок 1.3. Содержание глюкозы в крови в норме и при сахарном диабете\n\nГлюкоза — один из ключевых показателей здоровья. Её уровень важен как для здоровых людей, так и для пациентов с диабетом.\n\nНормальный уровень глюкозы:\n• Натощак — до 6,1 ммоль/л.\n• Через 2 часа после еды — до 7,8 ммоль/л.\n\nОрганизм поддерживает этот баланс благодаря работе поджелудочной железы, печени и гормону инсулину, который помогает глюкозе попадать в клетки для получения энергии. После еды уровень инсулина повышается, при физической активности — снижается.\n\nПри сахарном диабете:\nРегуляция нарушается — при недостатке инсулина глюкоза не попадает в клетки и накапливается в крови. Диагноз СД устанавливается, если:\n• натощак ≥ 7,0 ммоль/л;\n• через 2 часа после приёма 75 г глюкозы ≥ 11,1 ммоль/л.\n\nПромежуточное состояние — преддиабет:\n1. Нарушенная толерантность к глюкозе: через 2 часа после нагрузки — 7,8–11,0 ммоль/л.\n2. Нарушенная гликемия натощак: 6,1–7,0 ммоль/л натощак, через 2 часа — до 7,8 ммоль/л.\n\nПреддиабет — сигнал о высоком риске развития СД 2 типа. Его можно предотвратить, нормализовав питание, вес и физическую активность.",
            "1.4": "Урок 1.4. Признаки повышенной концентрации глюкозы в крови (гипергликемия)\n\nГипергликемия — состояние, при котором уровень глюкозы в крови превышает норму. Она часто возникает у людей с сахарным диабетом при недостатке инсулина, нарушении питания, стрессе или болезни.\n\nОсновные признаки гипергликемии:\n\n1. Частое и обильное мочеиспускание, жажда, сухость кожи и слизистых, утомляемость, потеря веса.\n• При уровне глюкозы выше 8–10 ммоль/л почки начинают выводить избыток сахара с мочой.\n• Организм теряет много жидкости, что вызывает обезвоживание, сухость кожи, выраженную жажду.\n\nВажно: при гипергликемии необходимо пить больше жидкости, чтобы избежать обезвоживания.\n\n2. Слабость, сонливость, повышенный аппетит.\n• Несмотря на избыток глюкозы в крови, клетки не могут её использовать из-за нехватки инсулина — возникает «энергетическое голодание».\n\n3. Потеря массы тела.\n• При недостатке инсулина организм начинает использовать жиры как источник энергии, что приводит к снижению веса.\n\n4. Медленное заживление ран и воспаления.\n• Высокий уровень глюкозы ослабляет иммунитет и снижает способность организма противостоять инфекциям.\n\n5. Зуд кожи и слизистых.\n• Связан с раздражением нервных окончаний на фоне повышенной глюкозы.",
            "1.5": "Урок 1.5. Механизм действия инсулина\n\nИнсулин — гормон белковой природы, вырабатываемый β-клетками поджелудочной железы и поступающий непосредственно в кровь.\n\nИнсулин можно представить как «ключ», который открывает клетке доступ к глюкозе. Когда инсулин связывается с рецептором на поверхности клетки, он позволяет глюкозе проникнуть внутрь.\n\nПопав в клетку, глюкоза используется для получения энергии, и её уровень в крови снижается — это и есть сахароснижающий эффект инсулина.\n\nЕсли в организме недостаточно собственного инсулина или клетки перестают на него реагировать, глюкоза остаётся в крови и не может быть использована — развивается гипергликемия.\n\nТаким образом, инсулин регулирует углеводный обмен и является главным гормоном, поддерживающим нормальный уровень сахара в крови."
        },

        "2": {
            "2.1": "Урок 2.1. Виды осложнений\n\nСахарный диабет опасен своими осложнениями. Если уровень глюкозы длительно остаётся повышенным, повреждаются различные органы: глаза, почки, нервы, сосуды и ноги.\n\nОсложнения диабета делятся на два вида — хронические и острые.\n\nХронические осложнения развиваются в результате длительного (годами и десятилетиями) воздействия высокой глюкозы крови на органы и системы организма. Гипергликемия поражает практически все органы.\n– Диабетическая ретинопатия\n– Диабетическая нефропатия\n– Диабетическая полинейропатия\n\nОстрые осложнения развиваются быстро — в течение часов или дней. Они связаны с резкими колебаниями уровня глюкозы.\nОни включают:\n– Гипогликемию (лёгкую и тяжёлую)\n– Диабетический кетоацидоз\n\nВажно: хронические осложнения формируются годами устойчивой гипергликемии, тогда как острые могут возникнуть в течение нескольких часов.",
            "2.2": "Урок 2.2. Кетоацидоз\n\nДиабетический кетоацидоз (ДКА) — острое осложнение сахарного диабета, связанное с высокой глюкозой крови и накоплением кетоновых тел.\n\nУ кого развивается ДКА?\n• Чаще всего у пациентов с СД 1 типа.\n• Может возникать у пациентов с СД 2 типа, находящихся на инсулинотерапии.\n• Возможен у пациентов с СД 2 типа на таблетированных препаратах при тяжёлых сопутствующих заболеваниях (операции, инфекции — например, бактериальная пневмония).\n\nПри серьёзных заболеваниях повышается выработка гормонов (кортизол, адреналин), которые уменьшают чувствительность к инсулину и повышают уровень глюкозы. Поэтому иногда требуется временный переход на инсулин.\n\nЛабораторные признаки ДКА:\n• высокая глюкоза крови,\n• повышенные кетоновые тела — продукты распада жиров.\n\nПочему это происходит?\nИз-за отсутствия инсулина организм не может использовать углеводы как источник энергии и начинает расщеплять жиры, образуя кетоны.\n\nСимптомы кетоацидоза:\n• признаки гипергликемии (тошнота, рвота, боль в животе, слабость, нарушение сознания)\n• частое мочеиспускание\n• выраженная жажда\n• потеря веса\n\nЧто делать при ДКА?\nСамостоятельно справиться невозможно. Требуется:\n• вызвать скорую помощь\n• госпитализация в стационар\n\nДо приезда скорой:\nЕсли пациент в сознании — можно дать минеральную воду. Щёлочь частично снижает уровень кетонов. При отсутствии — дать обычную воду.",
            "2.3": "Урок 2.3. Диабетическая ретинопатия\n\nДиабетическая ретинопатия (ДР) — поражение сосудов сетчатки, возникающее из-за длительно повышенной глюкозы.\n\nКак развивается ретинопатия?\n• На ранних стадиях сосуды становятся извитыми, формируются микроаневризмы.\n• На поздних — появляются кровоизлияния, возможна отслойка сетчатки и даже необратимая потеря зрения.\n\nДиабетический макулярный отёк (ДМО)\n• Возникает из-за повышенной проницаемости сосудов сетчатки.\n• Может развиться на любой стадии ДР и даже при отсутствии видимых изменений глазного дна.\n\nПочему важно обследоваться?\nРанние стадии ДР не сопровождаются снижением зрения — распознать их может только офтальмолог.\nЕжегодный осмотр (даже при отсутствии жалоб) позволяет выявить болезнь на обратимых стадиях.\nОсмотр должен проводиться на расширенном зрачке.\n\nПрофилактика\nХорошая компенсация диабета значительно снижает риск развития ДР или её прогрессирования.\n\nМетоды лечения:\n• лазерная коагуляция сетчатки,\n• введение ингибиторов ангиогенеза или пролонгированных кортикостероидов,\n• витрэктомия.\n\nМетод лечения определяется офтальмологом в сотрудничестве с эндокринологом.",
            "2.4": "Урок 2.4. Диабетическая нефропатия\n\nДиабетическая нефропатия — поражение сосудов почек, возникающее при длительной гипергликемии. При хорошей компенсации диабета изменения могут не развиваться.\n\n1. Диагностика нарушений в почках\n• Общий анализ мочи: выявляет только общее количество белка, на ранних стадиях малоинформативен.\n• Микроальбуминурия (МАУ): ранний маркер поражения — появление альбумина в моче. Анализ требуется не реже 1 раза в год.\n• Соотношение альбумин/креатинин в утренней моче: норма — до 30 мг/ммоль.\n• Суточная экскреция альбумина: до 30 мг/сут — норма; 30–300 мг — МАУ; >300 мг — протеинурия.\n• Другие причины белка в моче: воспалительные заболевания (например, хронический пиелонефрит).\n\n2. Артериальная гипертензия при нефропатии\n• Повышенное давление может быть следствием поражения почек, но даже само по себе ухудшает их состояние.\n• Контроль давления обязателен.\n• Нормы давления:\n  – до 65 лет: САД ≤130 мм рт. ст.\n  – старше 65 лет: САД ≤140 мм рт. ст.\n  – ДАД: ≤80 мм рт. ст. в любом возрасте.\n• Если показатели выше нормы — требуется лечение.\n\n3. Стадии нефропатии и хронической болезни почек (ХБП)\nДиабетическая нефропатия относится к ХБП. Стадия определяется уровнем альбумина в моче и скоростью клубочковой фильтрации (СКФ). Терминальная почечная недостаточность — крайняя стадия ХБП, требующая регулярного диализа.",
            "2.5": "Урок 2.5. Диабетическая полинейропатия\n\nДиабетическая полинейропатия нижних конечностей — поражение нервов ног, вызванное длительной гипергликемией. В отличие от ретинопатии и нефропатии (поражение мелких сосудов), при нейропатии значимую роль играет поражение крупных сосудов, связанное с атеросклерозом, который усиливается при высоком уровне глюкозы.\n\nОсновные симптомы:\n• боль в ногах (разной интенсивности),\n• жжение,\n• покалывание, «мурашки»,\n• онемение — снижение чувствительности к температуре, боли, вибрации.\n\nОпасности:\n• незамеченные травмы (посторонние предметы в обуви, неудобная обувь),\n• неправильное распределение нагрузки из-за деформации стоп,\n• воспаления и инфекции без боли,\n• образование язв, флегмоны, риск гангрены.\n\nПоражение артерий приводит к ухудшению кровоснабжения ног, особенно у пожилых пациентов. Характерный признак — боль в голени при ходьбе, требующая остановки. Это называется «перемежающаяся хромота».\n\nДля профилактики тяжёлых осложнений необходим ежегодный осмотр в кабинете «диабетической стопы» или у невролога.\n\nКлючевая мера профилактики — нормализация глюкозы крови. Дополнительно важны уход за стопами и ношение ортопедической обуви.\n\nУход за стопами при диабете:\n\nЧто нужно делать:\n1. Осматривать стопы ежедневно.\n2. Мыть ноги тёплой водой (35–37°C), тщательно вытирать.\n3. Увлажнять кожу стоп, избегая межпальцевых промежутков.\n4. Подстригать ногти ровно, без закругления углов.\n5. Носить удобную закрытую мягкую обувь, предпочтительно ортопедическую.\n6. Использовать хлопковые носки без тугой резинки.\n7. Применять тальк при потливости.\n\nЧего категорически нельзя:\n1. Ходить босиком в любых условиях.\n2. Греть ноги горячей водой, грелками, батареями.\n3. Обрабатывать раны спиртом, йодом, зелёнкой — только антисептики (миромистин/хлоргексидин).\n4. Удалять мозоли, натоптыши, вросшие ногти самостоятельно.\n5. Носить жёсткую, узкую или открытую обувь.\n6. Использовать грелки, электропростыни, горячие ванночки (выше 37°C)."
        },

        "3": {
            "3.1": "Урок 3.1. Гликированный гемоглобин (HbA1c)\n\nГликированный гемоглобин (HbA1c) — ключевой показатель контроля сахарного диабета. Он показывает средний уровень глюкозы за последние 2–3 месяца, а не в момент измерения.\n\nКогда глюкоза в крови повышена, часть сахара связывается с гемоглобином в эритроцитах. Чем выше глюкоза — тем больше HbA1c.\n\nЭтот показатель даёт более точную картину компенсации диабета, чем разовые измерения сахара.\n\nЦелевые значения HbA1c:\n• для большинства взрослых — менее 7,0 %;\n• целевой уровень индивидуален и зависит от возраста, сопутствующих болезней и осложнений.\n\nПовышенный HbA1c означает:\n• недостаточный контроль гликемии;\n• повышенный риск сосудистых, неврологических, офтальмологических и почечных осложнений;\n• необходимость корректировки лечения и образа жизни.\n\nКонтроль HbA1c проводится 1 раз в 3–6 месяцев для оценки эффективности терапии.",
            "3.2": "Урок 3.2. Индивидуальные цели лечения\n\nЛечение сахарного диабета всегда индивидуально. У разных пациентов различаются возраст, длительность заболевания, наличие осложнений, сопутствующие болезни и образ жизни — поэтому терапия подбирается персонально.\n\nГлавная цель — создать такой план лечения, который обеспечивает хорошее самочувствие, предотвращает осложнения и улучшает качество жизни.\n\nПочему важен индивидуальный подход?\nПовышенный сахар может привести к поражению глаз, почек, нервов, ног, а также увеличивает риск инфаркта и инсульта. Для профилактики необходимо контролировать несколько ключевых показателей.\n\nОсновные целевые параметры контроля:\n1) Гликированный гемоглобин (HbA1c) — отражает средний сахар за 2–3 месяца. Для большинства пациентов цель — < 7,0 %.\n2) Уровень глюкозы крови — регулярный контроль помогает предотвратить осложнения и снизить риск гипогликемии.\n3) Артериальное давление — высокое давление усиливает риск инфаркта, инсульта и поражения почек.\n4) Липидный обмен — необходимо контролировать уровень ЛПНП (плохого холестерина). Целевое значение зависит от индивидуального кардиоваскулярного риска.",
            "3.3": "Урок 3.3. Технические средства самоконтроля\n\nГлюкометры\nГлюкометр — портативный прибор для измерения уровня глюкозы. Он даёт результат за 5–20 секунд и требует минимальное количество крови. Современные модели имеют память, показывают средний уровень сахара и подходят людям со сниженным зрением.\n\nТипы глюкометров:\n1) Фотометрические — определяют изменение цвета тест-полоски.\n2) Электрохимические — измеряют электрический ток реакции глюкозы на полоске.\n\nТочность измерений\nГлюкометры должны соответствовать ГОСТ Р ИСО 15197-2015:\n• при глюкозе < 5.6 ммоль/л — отклонение ≤ ±0.8 ммоль/л;\n• при ≥ 5.6 ммоль/л — отклонение ≤ ±15%.\nПримеры: 4.0 ммоль/л → 3.2–4.8 ммоль/л; 10.0 ммоль/л → 8.0–12.0 ммоль/л.\n\nОшибки, влияющие на результат:\n• грязные или влажные руки;\n• остатки крема или дезсредств;\n• мало крови на полоске;\n• просроченные или неправильно хранящиеся полоски;\n• измерение при неподходящей температуре.\n\nСистемы непрерывного мониторирования глюкозы (НМГ)\nНМГ используется при необходимости частого контроля. Сенсор под кожей измеряет глюкозу каждые 5–15 минут. Возможна задержка данных на 8–10 минут относительно крови.\n\nТипы систем НМГ:\n1) CGM — непрерывный мониторинг в реальном времени: показывает уровень глюкозы, направление и скорость изменения, передает данные на смартфон, имеет сигналы тревоги, требует периодической калибровки.\n2) FGM — флеш-мониторирование: данные отображаются при сканировании сенсора, калибровка не требуется, можно фиксировать инсулин, еду и активность, формируется электронный дневник.\n\nНМГ позволяет оценивать время в целевом диапазоне, частоту гипогликемий и вариабельность глюкозы."
        },

        "4": {
            "4.1": "Урок 4.1. Препараты инсулина\n\nИнсулинотерапия — основной метод лечения сахарного диабета 1 типа и важный компонент терапии при диабете 2 типа. Инсулин используется, когда собственный гормон отсутствует или вырабатывается недостаточно.\n\nВиды инсулинов по происхождению\n1) Животные инсулины: ранее применялись свиной и бычий инсулин, отличающийся от человеческого и вызывающий больше аллергических реакций.\n2) Человеческие инсулины: получены генно-инженерным способом, полностью идентичны человеческому. Являются стандартом терапии.\n3) Аналоги человеческого инсулина: модифицированные формы с улучшенными свойствами — более быстрым или длительным действием, меньшей вариабельностью, удобством использования.\n\nЗачем нужны разные виды инсулина\nИнсулины различаются по скорости начала действия, времени пика и общей длительности. Это позволяет подобрать схему, максимально похожую на естественную работу поджелудочной железы и снизить риск гипогликемии.\n\nТипы инсулинов по скорости действия\n\n1) Сверхбыстрого действия (аналоги человеческого инсулина)\n• Начало действия: 1–10 минут\n• Пик: 45–90 минут\n• Длительность: 3–5 часов\n• Примеры: инсулин аспарт (+никотинамид + аргинин), инсулин лизпро 100 Ед/мл (+трепростинил + цитрат натрия), инсулин лизпро 200 Ед/мл (+трепростинил + цитрат натрия)\n\n2) Ультракороткого действия (аналоги человеческого инсулина)\n• Начало: 5–15 минут\n• Пик: 1–2 часа\n• Длительность: 4–5 часов\n• Примеры: инсулин лизпро 100/200 Ед/мл, инсулин аспарт, инсулин глулизин\n\n3) Короткого действия\n• Начало: 20–30 минут\n• Пик: 2–4 часа\n• Длительность: 5–6 часов\n• Пример: растворимый человеческий инсулин\n\n4) Средней продолжительности действия\n• Начало: около 2 часов\n• Пик: 6–10 часов\n• Длительность: 12–16 часов\n• Пример: инсулин-изофан (НПХ)\n\n5) Длительного действия (аналоги человеческого инсулина)\n• Начало: 1–2 часа\n• Пик: отсутствует\n• Длительность: до 29–36 часов (иногда 24 часа)\n• Примеры: инсулин гларгин 100/300 Ед/мл, инсулин детемир\n\n6) Сверхдлительного действия (аналоги человеческого инсулина)\n• Начало: 30–90 минут\n• Пик: отсутствует\n• Длительность: более 42 часов\n• Пример: инсулин деглудек",
            "4.2": "Урок 4.2. Режимы инсулинотерапии\n\nЧтобы поддерживать уровень глюкозы, максимально приближенный к норме, пациентам с диабетом требуется вводить инсулин несколько раз в день. Выбор режима зависит от возраста, образа жизни и индивидуальных потребностей.\n\n1. Интенсифицированная инсулинотерапия (многократные инъекции)\nЭтот режим имитирует естественную секрецию инсулина.\n• Инсулин длительного действия — для базального уровня.\n• Короткий или ультракороткий инсулин — перед едой.\nПреимущества: физиологичность, гибкость, возможность коррекции доз.\nПрименение: диабет 1 типа; диабет 2 типа при необходимости строгого контроля.\n\n2. Помповая инсулинотерапия\nИнсулиновая помпа обеспечивает непрерывную подачу инсулина.\n• Базальная доза подается постоянно.\n• Болюсы вводятся перед едой.\nПреимущества: высокая точность доз, снижение риска гипо- и гипергликемии, свобода в питании.\nПрименение: диабет 1 типа у пациентов, требующих индивидуального режима.\n\n3. Двухфазная (смешанная) инсулинотерапия\nИспользуются комбинированные препараты:\n• короткий инсулин;\n• инсулин средней продолжительности.\nРежим введения: 2 раза в день — утром и вечером.\nПреимущества: меньше инъекций, удобство для пожилых.\nОсобенность: требуется строгий режим питания с одинаковым количеством углеводов.\n\nОсновные режимы инсулинотерапии:\n1) Интенсифицированная терапия — инъекции короткого и длительного инсулина в разное время. Применение: диабет 1 типа, диабет 2 типа при необходимости строгого контроля.\n2) Постоянная подкожная инфузия (помповая терапия) — постоянная подача инсулина насосом с программируемым режимом. Применение: диабет 1 типа при необходимости индивидуального режима.\n3) Двухфазная терапия — комбинация двух видов инсулина в одной инъекции. Применение: диабет 2 типа и пожилые пациенты для удобства.",
            "4.3": "Урок 4.3. Дозы инсулина\n\nОдно из важнейших умений пациента с сахарным диабетом — самостоятельно рассчитывать и корректировать дозы инсулина. Фиксированной дозы не существует, потому что потребности организма постоянно меняются. Особенно это касается короткого и ультракороткого инсулина. Его доза зависит от:\n• уровня глюкозы;\n• количества углеводов в пище;\n• физической активности;\n• состояния здоровья и уровня стресса.\n\nГлавное правило:\nНельзя ориентироваться на универсальные пропорции вроде «50/50 базальный и короткий инсулин» или «1 ед. инсулина на 1 хлебную единицу». Это усреднённые данные и не подходят всем. Единственный показатель правильной дозы — стабильный уровень глюкозы.\n\nКак проверить правильность дозы:\n1) Длительный инсулин на ночь:\n• доза подобрана правильно, если утром сахар натощак в норме и нет ночной гипогликемии;\n• проверяется при условии, что вечерний сахар был нормальным.\n\n2) Длительный инсулин утром:\n• пропустите обед и не вводите короткий инсулин;\n• если уровень глюкозы стабильный до ужина — доза верная.\n\n3) Короткий (ультракороткий) инсулин перед едой:\n• измерьте сахар через 2 часа после еды и перед следующей трапезой (через 4–6 часов);\n• уровень сахара перед обедом показывает эффективность утренней дозы, перед ужином — дневной.\n\nЗачем нужен такой подход:\nИндивидуальный самоконтроль позволяет:\n• повысить эффективность лечения;\n• снизить риск гипогликемии;\n• адаптировать терапию под питание и образ жизни пациента.",
            "4.4": "Урок 4.4. Углеводный коэффициент\n\nУглеводный коэффициент (УК) — это количество инсулина, необходимое для покрытия 1 хлебной единицы (ХЕ) или определённого количества граммов углеводов.\nОн показывает, сколько единиц инсулина требуется на 1 ХЕ, или сколько граммов углеводов покрывает 1 единица инсулина.\n\nФормулы расчёта:\nУК = болюсная доза / количество ХЕ за сутки\nУК = суточная доза инсулина / 50\n\nПример:\nПациент планирует съесть 2 ХЕ. При УК = 2.0:\n2 × 2.0 = 4 ед инсулина.\nЗначит, нужно ввести 4 единицы инсулина.\n\nВажно:\n• УК может отличаться утром, днём и вечером.\n• Меняется с возрастом, образом жизни и физической активностью.\n• Подбирается индивидуально и корректируется по уровню глюкозы.",
            "4.5": "Урок 4.5. Фактор чувствительности к инсулину\n\nФактор чувствительности к инсулину (ФЧИ) — это показатель, показывающий, на сколько ммоль/л 1 единица инсулина снижает уровень глюкозы крови. Этот показатель используется для расчёта дозы короткого инсулина, необходимой для снижения повышенного сахара.\n\nПример:\nЕсли глюкоза была 12 ммоль/л, и после введения 1 Ед инсулина через 4 часа стала 9 ммоль/л, то:\nФЧИ = 3,0 ммоль/л на 1 Ед инсулина."
        }
    }
}
